In [22]:
# 값 치환하기
# 295p
import pandas as pd

data = pd.Series([1.0,-999,2.0,-999,-1000,3.0])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [24]:
import numpy as np
# data.replace([-999, -1000], [np.nan, 0])

In [25]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [27]:
# 축 색인 이름 바꾸기
# 297p
data = pd.DataFrame(
    np.arange(12).reshape((3,4)),
    index=['ohio','colorado','new york'],
    columns=['one','two','three','four']
)
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [29]:
data.rename(index=str.capitalize, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New york    8    9     10    11